Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1403_Q40/RTE_Device.h
/*
 * Copyright (c) 2015-2020, Infineon Technologies AG
 * All rights reserved.                        
 *                                             
 * Boost Software License - Version 1.0 - August 17th, 2003
 * 
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 * 
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer,
 * must be included in all copies of the Software, in whole or in part, and
 * all derivative works of the Software, unless such copies or derivative
 * works are solely in the form of machine-executable object code generated by
 * a source language processor.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *                                                                              
 * To improve the quality of the software, users are encouraged to share 
 * modifications, enhancements or bug fixes with Infineon Technologies AG 
 * at XMCSupport@infineon.com.
 *
 */

/**
 * @file RTE_Device.h
 * @date 16 Nov., 2020
 * @version 1.4.0
 *
 * @brief RTE Device Configuration for Infineon XMC1403/4_Q40
 *
 * History
 *
 * Version 1.0.0 
 *  Initial version
 *
 * Version 1.1.0 
 * - [New] CAN and SAI drivers 
 * - [Changed] Limit RX and TX FIFO sum of single channel to 32 entries
 * - [Fixed] Several pin configurations fixed
 * 
 * Version 1.2.0
 * - [New] Added IRQ priority setting for drivers
 * - [New] Added Hold delay option for I2C driver
 * 
 * Version 1.3.0
 * - [New] Added CAN clock source selection
 * 
 * Version 1.4.0
 * - [Changed] Added definitions for not used USIC channels
 * 
 */

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

#ifndef __RTE_DEVICE_H
#define __RTE_DEVICE_H

#include "xmc_device.h"
#include "xmc1_gpio_map.h"
#include "xmc1_usic_map.h"
#include "xmc_can_map.h"

#define NO_FIFO 0
#define FIFO_SIZE_2 1
#define FIFO_SIZE_4 2
#define FIFO_SIZE_8 3
#define FIFO_SIZE_16 4
#define FIFO_SIZE_32 5

/*
//    <o> CAN clock source
//       <1=> MCLK
//       <2=> OSC_HP
//    <i> Default: MCLK
*/
#define RTE_CAN_CLKSRC 1
#define RTE_CAN_CLKSRC_MCLK 1
#define RTE_CAN_CLKSRC_OSC_HP 2

// <e> CAN0 (Controller area network) [Driver_CAN0]
// <i> Configuration settings for Driver_CAN0 in component ::Drivers:CAN
#define RTE_CAN0                      0

//   <o> CAN0 TX Pin <0=>P0_4 <1=>P0_5 <2=>P0_14 <3=>P0_15 <4=>P1_0 <5=>P1_1 <6=>P2_0 <7=>P2_1
#define RTE_CAN0_TX_ID                0
#if    (RTE_CAN0_TX_ID == 0)
#define RTE_CAN0_TX_PORT              P0_4
#define RTE_CAN0_TX_AF                P0_4_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 1)
#define RTE_CAN0_TX_PORT              P0_5
#define RTE_CAN0_TX_AF                P0_5_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 2)
#define RTE_CAN0_TX_PORT              P0_14
#define RTE_CAN0_TX_AF                P0_14_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 3)
#define RTE_CAN0_TX_PORT              P0_15
#define RTE_CAN0_TX_AF                P0_15_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 4)
#define RTE_CAN0_TX_PORT              P1_0
#define RTE_CAN0_TX_AF                P1_0_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 5)
#define RTE_CAN0_TX_PORT              P1_1
#define RTE_CAN0_TX_AF                P1_1_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 6)
#define RTE_CAN0_TX_PORT              P2_0
#define RTE_CAN0_TX_AF                P2_0_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 7)
#define RTE_CAN0_TX_PORT              P2_1
#define RTE_CAN0_TX_AF                P2_1_AF_CAN_N0_TXD
#else
#error "Invalid CAN0_TX Pin Configuration!"
#endif

//   <o> CAN0 RX Pin <0=>P0_4 <1=>P0_5 <2=>P0_14 <3=>P0_15 <6=>P1_0 <7=>P1_1 <6=>P2_0 <7=>P2_1
#define RTE_CAN0_RX_ID                0
#if    (RTE_CAN0_RX_ID == 0)
#define RTE_CAN0_RX_PORT              P0_4
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P0_4
#elif  (RTE_CAN0_RX_ID == 1)
#define RTE_CAN0_RX_PORT              P0_5
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P0_5
#elif  (RTE_CAN0_RX_ID == 2)
#define RTE_CAN0_RX_PORT              P0_14
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P0_14
#elif  (RTE_CAN0_RX_ID == 3)
#define RTE_CAN0_RX_PORT              P0_15
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P0_15
#elif  (RTE_CAN0_RX_ID == 4)
#define RTE_CAN0_RX_PORT              P1_0
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P1_0
#elif  (RTE_CAN0_RX_ID == 5)
#define RTE_CAN0_RX_PORT              P1_1
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P1_1
#elif  (RTE_CAN0_RX_ID == 6)
#define RTE_CAN0_RX_PORT              P2_0
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P2_0
#elif  (RTE_CAN0_RX_ID == 7)
#define RTE_CAN0_RX_PORT              P2_1
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P2_1
#else
#error "Invalid CAN0_RX Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of CAN events IRQ handling
// <i> Default: 63
#define RTE_CAN0_IRQ_PRIORITY  3

// </e>

// <e> CAN1 (Controller area network) [Driver_CAN1]
// <i> Configuration settings for Driver_CAN1 in component ::Drivers:CAN
#define RTE_CAN1                      0

//   <o> CAN1 TX Pin <0=>P0_12 <1=>P0_13 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11
#define RTE_CAN1_TX_ID                0
#if    (RTE_CAN1_TX_ID == 0)
#define RTE_CAN1_TX_PORT              P0_12
#define RTE_CAN1_TX_AF                P0_12_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 1)
#define RTE_CAN1_TX_PORT              P0_13
#define RTE_CAN1_TX_AF                P0_13_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 2)
#define RTE_CAN1_TX_PORT              P1_2
#define RTE_CAN1_TX_AF                P1_2_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 3)
#define RTE_CAN1_TX_PORT              P1_3
#define RTE_CAN1_TX_AF                P1_3_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 4)
#define RTE_CAN1_TX_PORT              P2_10
#define RTE_CAN1_TX_AF                P2_10_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 5)
#define RTE_CAN1_TX_PORT              P2_11
#define RTE_CAN1_TX_AF                P2_11_AF_CAN_N1_TXD
#else
#error "Invalid CAN1_TX Pin Configuration!"
#endif

//   <o> CAN1 RX Pin <0=>P0_12 <1=>P0_13 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11
#define RTE_CAN1_RX_ID                0
#if    (RTE_CAN1_RX_ID == 0)
#define RTE_CAN1_RX_PORT              P0_12
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P0_12
#elif  (RTE_CAN1_RX_ID == 1)
#define RTE_CAN1_RX_PORT              P0_13
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P0_13
#elif  (RTE_CAN1_RX_ID == 2)
#define RTE_CAN1_RX_PORT              P1_2
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P1_2
#elif  (RTE_CAN1_RX_ID == 3)
#define RTE_CAN1_RX_PORT              P1_3
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P1_3
#elif  (RTE_CAN1_RX_ID == 4)
#define RTE_CAN1_RX_PORT              P2_10
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P2_10
#elif  (RTE_CAN1_RX_ID == 5)
#define RTE_CAN1_RX_PORT              P2_11
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P2_11 
#else
#error "Invalid CAN1_RX Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of CAN events IRQ handling
// <i> Default: 63
#define RTE_CAN1_IRQ_PRIORITY  3

// </e>

#define RTE_CAN2                      0
#define RTE_CAN3                      0
#define RTE_CAN4                      0
#define RTE_CAN5                      0

// <e> UART0 (Universal asynchronous receiver transmitter) [Driver_USART0]
// <i> Configuration settings for Driver_USART0 in component ::Drivers:UART
#define RTE_UART0                      0

